[HIVETerror X2MissionTemplate]
DisplayName="虫群围攻"
Briefing="这里的平民人数比预期的要多。这一定是寄生兽虫群中的。我们必须拯救尽可能多的平民。"
PostMissionType="虫群围攻"
BriefingImage="img:///UILibrary_Common.Xcom_default"
MissionImage ="img:///UILIB_TheHiveMore.UI_MissionPrv_Swarm";
ObjectiveTextPools[0]="一些反抗军设法坚持了下来，但不会坚持太久。我们必须拯救尽可能多的平民。"
ObjectiveTextPools[1]="在寄生兽虫群吞噬平民之前拯救他们。"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Unique.Central_Unique_Missions_Terror_Attack"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_05"
PreMissionNarratives[5]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_01"
PreMissionNarratives[6]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_02"
PreMissionNarratives[7]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_03"
PreMissionNarratives[8]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_04"
PreMissionNarratives[9]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_05"

[HIVETerror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="至少从寄生兽虫群中拯救6名平民"
ObjectiveTextPools[1]="消灭寄生兽先头部队（Advance）"
ObjectiveTextPools[2]="撤出全部XCOM士兵"


[HIVEFishingTerror X2MissionTemplate]
DisplayName="调查渔村骚乱"
Briefing="反抗军报告称有来自海洋的生物。我们与渔村失去了联系，需要调查。"
PostMissionType="调查渔村骚乱"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="消灭寄生兽威胁"

[HIVEFishingTerror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="消灭寄生兽威胁"

[HIVESupplyExtractionTerror X2MissionTemplate]
DisplayName="夺取补给并且营救被寄生兽威胁的平民"
Briefing="护送平民的一支小型反抗军发现了一处遗弃的变种人补给物资存储场。进去！帮助反抗军，在变种人之前获得这些补给。"
PostMissionType="夺取补给并且营救被寄生兽威胁的平民"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="保护和夺取反抗军补给"
ObjectiveTextPools[1]="消灭所有敌方目标"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_C"

[HIVESupplyExtractionTerror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="标记并回收反抗军物资箱"
ObjectiveTextPools[1]="消灭所有敌方目标"
ObjectiveTextPools[2]="撤出全部XCOM士兵"
ObjectiveTextPools[3]="或者：消灭所有残余的敌方目标"


[HIVECovertEscape X2MissionTemplate]
DisplayName="逃离寄生兽追猎部队（hunters）"
Briefing="隐秘行动：逃离寄生兽追猎部队（hunters）"
PostMissionType="逃离寄生兽追猎部队（hunters）"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="逃离战斗区域"

[HIVECovertEscape X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="到达汇合点"
ObjectiveTextPools[1]="躲避寄生兽并且撤离"

[HIVEChosenAvengerDefense X2MissionTemplate]
DisplayName="击退虫巢报复部队（Avenger）的进攻"
Briefing="防御复仇者号免受天选者和寄生兽虫群的攻击"
PostMissionType="虫巢报复部队（Avenger）袭击"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="保护复仇者号免受寄生兽的威胁"
ObjectiveTextPools[1]="找到并摧毁干扰器"

[HIVEChosenAvengerDefense X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="摧毁所有瞄准复仇者号的炮塔"
ObjectiveTextPools[1]="摧毁便携式发电机"
ObjectiveTextPools[2]="消灭寄生兽威胁"


[HiveAvengerDefense X2MissionTemplate]
DisplayName="防御复仇者号免受寄生兽虫群的攻击"
Briefing="防御复仇者号免受寄生兽虫群的攻击"
PostMissionType="防御复仇者号免受寄生兽虫群的攻击"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="保护复仇者号免受寄生兽虫群的威胁"
ObjectiveTextPools[1]="找到并摧毁干扰器"

[HIVEAvengerDefense X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="将所有XCOM士兵撤回复仇者号舷梯"
ObjectiveTextPools[1]="下达起飞命令"
ObjectiveTextPools[2]="消灭破坏者"
ObjectiveTextPools[3]="阻止敌人进入复仇者号舷梯"


[HiveGatherSurvivors X2MissionTemplate]
DisplayName="从被虫巢侵扰的废弃城市中，收集幸存者"
Briefing="从被虫巢侵扰的废弃城市中，收集幸存者。获得幸存者并带离！"
PostMissionType="从被虫巢侵扰的废弃城市中，收集幸存者"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="收集反抗军幸存者"
ObjectiveTextPools[1]="护送幸存者到撤离点"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Gather_Survivors_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Gather_Survivors_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Gather_Survivors_Dropship_Intro_C"

[HiveGatherSurvivors X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="营救反抗军联络人"
ObjectiveTextPools[1]="营救反抗军VIP"
ObjectiveTextPools[2]="可选：营救幸存的反抗军特工"
ObjectiveTextPools[3]="将VIP护送到指定的撤离点"
ObjectiveTextPools[4]="撤出所有XCOM特工"

[HIVERipperSwarm X2MissionTemplate]
DisplayName="调查大量寄生兽虫群的报告"
Briefing="抵抗军报告称，该地区有大量寄生兽侵扰。我们应该前去调查。"
PostMissionType="调查寄生兽虫群的报告"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="消灭寄生兽撕裂者虫群"

[HIVERipperSwarm X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="消灭寄生兽撕裂者虫群"


[HIVENewfoundland X2MissionTemplate]
DisplayName="摧毁吸引寄生兽的发射器"
Briefing="摧毁吸引寄生兽前往渔村的发射器，找出我们失去联系的原因。"
PostMissionType="摧毁吸引寄生兽的发射器"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="消灭寄生兽威胁"
ObjectiveTextPools[1]="摧毁发射器"

[HIVENewfoundland X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="消灭寄生兽威胁"
ObjectiveTextPools[1]="摧毁发射器"




;*****HIVE MORE CHRYSSALID RIPPER*****

[CXRipperExploder X2CharacterTemplate]
strCharacterName="寄生兽针刺开膛器"

[RipperNeedleExplosion X2AbilityTemplate]
LocFriendlyName="针刺爆炸"
LocLongDescription="此开膛器极为不稳定并且会爆炸。"
LocHelpText="此开膛器极为不稳定并且会爆炸。"




